# Core Utils Alternatives
brew "bat"
brew "delta"
brew "eza"
brew "helix"
brew "ripgrep"
brew "zellij"
brew "zoxide"

# Utilities
brew "atuin"
brew "glow"
brew "jq"
brew "starship"

# Containers
brew "docker"
brew "docker-credential-helper"
cask "orbstack"

# Rust
brew "rustup"

# Python
brew "uv"
brew "ty"
brew "ruff"

# Fonts
cask "font-intel-one-mono"

# Terminal
cask "ghostty"

# Window Management
cask "rectangle"

# Proton
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "protonvpn"

# Google
cask "google-chrome"
cask "google-drive"

# Mozilla
cask "firefox"

# Video Players
cask "iina"
cask "jellyfin"

# Code Editors
cask "jetbrains-toolbox"

# Linux ISOs
cask "transmission"
cask "calibre"
cask "localsend"

# Messaging
cask "whatsapp"
